---
title: ViewPrintedEventArgs
classe: Autodesk.Revit.DB.Events.ViewPrintedEventArgs
namespace: Autodesk.Revit.DB.Events
eredita: Autodesk.Revit.DB.Events.RevitAPIPostDocEventArgs
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 3
---

# ViewPrintedEventArgs

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Int32 Index { get; }` | `viewPrintedEventArgs.Index` | Int32 |
| `Int32 TotalViews { get; }` | `viewPrintedEventArgs.TotalViews` | Int32 |
| `View View { get; }` | `viewPrintedEventArgs.View` | View |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```